SPC_wire_load_mode = enclosed

current_design TCAM
if (dc_shell_status =="TCAM") {
set_wire_load_mode SPC_wire_load_mode
set_wire_load_model -name TCAM_flat
}

